module.exports = {
	// يمكنك هنا أو مباشرة في ملفات الأوامر تخصيص وتعديل اللغة
	autoUpdateThreadInfo: {},
	checkwarn: {
		text: {
			warn: "تم تحذير العضو %1 سابقاً 3 مرات وتم حظره من صندوق الدردشة\n- الاسم: %1\n- المعرف (UID): %2\n- لإلغاء الحظر، يرجى استخدام الأمر \"%3warn unban <uid>\" (حيث uid هو معرف الشخص الذي تريد إلغاء حظره)",
			needPermission: "يتطلب الأمر صلاحيات مشرف البوت (Admin) لطرد الأعضاء المحظورين"
		}
	},
	leave: {
		text: {
			session1: "صباح",
			session2: "ظهر",
			session3: "عصر",
			session4: "مساء",
			leaveType1: "غادر المجموعة",
			leaveType2: "تم طرده من المجموعة"
		}
	},
	logsbot: {
		text: {
			title: "====== سجلات البوت (Logs) ======",
			added: "\n✅\nالحدث: تمت إضافة البوت إلى مجموعة جديدة\n- تمت الإضافة بواسطة: %1",
			kicked: "\n❌\nالحدث: تم طرد البوت من المجموعة\n- تم الطرد بواسطة: %1",
			footer: "\n- معرف المستخدم: %1\n- المجموعة: %2\n- معرف المجموعة: %3\n- الوقت: %4"
		}
	},
	onEvent: {},
	welcome: {
		text: {
			session1: "صباح",
			session2: "ظهر",
			session3: "عصر",
			session4: "مساء",
			welcomeMessage: "شكراً لدعوتي إلى المجموعة!\nبادئة الأوامر (Prefix): %1\nلعرض قائمة الأوامر، اكتب: %1help",
			multiple1: "أهلاً بك",
			multiple2: "أهلاً بكم جميعاً"
		}
	}
};
