module.exports = {
	// يمكنك هنا أو مباشرة في ملفات الأوامر تخصيص وتعديل اللغة
	onlyadminbox: {
		description: "تفعيل أو تعطيل وضع أن مشرفي المجموعة فقط هم من يمكنهم استخدام البوت",
		guide: "   {pn} [on | off]",
		text: {
			turnedOn: "تم تفعيل وضع أن مشرفي المجموعة فقط يمكنهم استخدام البوت",
			turnedOff: "تم تعطيل وضع أن مشرفي المجموعة فقط يمكنهم استخدام البوت",
			syntaxError: "خطأ في بناء الجملة، استخدم فقط {pn} on أو {pn} off"
		}
	},
	adduser: {
		description: "إضافة مستخدم إلى مجموعة الدردشة الخاصة بك",
		guide: "   {pn} [رابط البروفيل | المعرف uid]",
		text: {
			alreadyInGroup: "المستخدم موجود بالفعل في المجموعة",
			successAdd: "- تم بنجاح إضافة %1 من الأعضاء إلى المجموعة",
			failedAdd: "- فشل في إضافة %1 من الأعضاء إلى المجموعة",
			approve: "- تمت إضافة %1 من الأعضاء إلى قائمة الموافقة",
			invalidLink: "يرجى إدخال رابط فيسبوك صالح",
			cannotGetUid: "تعذر الحصول على معرف (uid) لهذا المستخدم",
			linkNotExist: "رابط البروفيل هذا غير موجود",
			cannotAddUser: "البوت محظور أو أن هذا المستخدم منع الغرباء من إضافته إلى المجموعة"
		}
	},
	admin: {
		description: "إضافة، إزالة، أو تعديل دور المشرف (Admin)",
		guide: "   {pn} [add | -a] <uid>: إضافة دور المشرف للمستخدم\n\t  {pn} [remove | -r] <uid>: إزالة دور المشرف من المستخدم\n\t  {pn} [list | -l]: عرض قائمة جميع المشرفين",
		text: {
			added: "✅ | تم تعيين دور المشرف لـ %1 من المستخدمين:\n%2",
			alreadyAdmin: "\n⚠️ | %1 من المستخدمين لديهم دور المشرف بالفعل:\n%2",
			missingIdAdd: "⚠️ | يرجى إدخال المعرف أو الإشارة إلى المستخدم لإضافة دور المشرف",
			removed: "✅ | تمت إزالة دور المشرف من %1 من المستخدمين:\n%2",
			notAdmin: "⚠️ | %1 من المستخدمين ليس لديهم دور المشرف:\n%2",
			missingIdRemove: "⚠️ | يرجى إدخال المعرف أو الإشارة إلى المستخدم لإزالة دور المشرف",
			listAdmin: "👑 | قائمة المشرفين:\n%1"
		}
	},
	adminonly: {
		description: "تفعيل أو تعطيل وضع أن مشرفي البوت فقط يمكنهم استخدام البوت",
		guide: "{pn} [on | off]",
		text: {
			turnedOn: "تم تفعيل وضع أن مشرفي البوت فقط يمكنهم استخدام البوت",
			turnedOff: "تم تعطيل وضع أن مشرفي البوت فقط يمكنهم استخدام البوت",
			syntaxError: "خطأ في بناء الجملة، استخدم فقط {pn} on أو {pn} off"
		}
	},
	all: {
		description: "الإشارة إلى جميع الأعضاء في دردشة المجموعة",
		guide: "{pn} [محتوى الرسالة | فارغ]"
	},
	anime: {
		description: "الحصول على صورة أنمي عشوائية",
		guide: "{pn} <النهاية/النوع>\n   قائمة الأنواع المتاحة: neko, kitsune, hug, pat, waifu, cry, kiss, slap, smug, punch",
		text: {
			loading: "جاري تجهيز الصورة، يرجى الانتظار...",
			error: "حدث خطأ، يرجى المحاولة مرة أخرى لاحقاً"
		}
	},
	antichangeinfobox: {
		description: "تفعيل أو تعطيل الحماية ضد تغيير معلومات المجموعة",
		guide: "   {pn} avt [on | off]: الحماية ضد تغيير صورة المجموعة\n   {pn} name [on | off]: الحماية ضد تغيير اسم المجموعة\n   {pn} theme [on | off]: الحماية ضد تغيير سمة (chủ đề/theme) المجموعة\n   {pn} emoji [on | off]: الحماية ضد تغيير رمز التعبير الإيموجي للمجموعة",
		text: {
			antiChangeAvatarOn: "تم تفعيل حماية تغيير صورة المجموعة",
			antiChangeAvatarOff: "تم تعطيل حماية تغيير صورة المجموعة",
			missingAvt: "لم تقم بتعيين صورة رمزية (avatar) للمجموعة بعد",
			antiChangeNameOn: "تم تفعيل حماية تغيير اسم المجموعة",
			antiChangeNameOff: "تم تعطيل حماية تغيير اسم المجموعة",
			antiChangeThemeOn: "تم تفعيل حماية تغيير سمة المجموعة",
			antiChangeThemeOff: "تم تعطيل حماية تغيير سمة المجموعة",
			antiChangeEmojiOn: "تم تفعيل حماية تغيير إيموجي المجموعة",
			antiChangeEmojiOff: "تم تعطيل حماية تغيير إيموجي المجموعة",
			antiChangeAvatarAlreadyOn: "حماية تغيير صورة المجموعة مفعلة بالفعل لديك",
			antiChangeNameAlreadyOn: "حماية تغيير اسم المجموعة مفعلة بالفعل لديك",
			antiChangeThemeAlreadyOn: "حماية تغيير سمة المجموعة مفعلة بالفعل لديك",
			antiChangeEmojiAlreadyOn: "حماية تغيير إيموجي المجموعة مفعلة بالفعل لديك"
		}
	},
	appstore: {
		description: "البحث عن تطبيق في متجر التطبيقات App Store",
		text: {
			missingKeyword: "لم تقم بإدخال أي كلمة مفتاحية للبحث",
			noResult: "لم يتم العثور على نتائج للكلمة المفتاحية %1"
		}
	},
	autosetname: {
		description: "التغيير التلقائي للكنية (اللقب) للأعضاء الجدد",
		guide: "   {pn} set <اللقب>: يستخدم لتعيين صيغة التغيير التلقائي للكنية، مع استخدام بعض الاختصارات المتاحة:\n   + {userName}: اسم العضو الجديد\n   + {userID}: معرف العضو\n   مثال:\n    {pn} set {userName} 🚀\n\n   {pn} [on | off]: لتفعيل أو تعطيل هذه الميزة\n\n   {pn} [view | info]: لعرض الإعدادات الحالية",
		text: {
			missingConfig: "يرجى إدخال الإعدادات المطلوبة",
			configSuccess: "تم تعيين الإعدادات بنجاح",
			currentConfig: "إعدادات تغيير الكنية التلقائي الحالية في مجموعتك هي:\n%1",
			notSetConfig: "لم تقم مجموعتك بتعيين إعدادات الكنية التلقائية",
			syntaxError: "خطأ في بناء الجملة، يمكن استخدام \"{pn} on\" أو \"{pn} off\" فقط",
			turnOnSuccess: "تم تفعيل ميزة تغيير الكنية التلقائي",
			turnOffSuccess: "تم تعطيل ميزة تغيير الكنية التلقائي",
			error: "حدث خطأ أثناء استخدام ميزة تغيير الكنية التلقائي، جرب إيقاف ميزة رابط الانضمام في المجموعة ثم حاول مرة أخرى"
		}
	},
	avatar: {
		description: "إنشاء صورة أباراتار أنمي مع توقيع شخصي",
		guide: "{p}{n} <معرف الشخصية أو اسمها> | <نص الخلفية> | <التوقيع> | <اسم لون الخلفية أو كود اللون السداسي Hex>\n{p}{n} help: لعرض كيفية استخدام هذا الأمر",
		text: {
			initImage: "جاري تهيئة الصورة، يرجى الانتظار...",
			invalidCharacter: "يوجد حالياً %1 شخصية فقط في النظام، يرجى إدخال معرف شخصية أقل من",
			notFoundCharacter: "لم يتم العثور على شخصية بالاسم %1 في قائمة الشخصيات",
			errorGetCharacter: "حدث خطأ أثناء جلب بيانات الشخصية:\n%1: %2",
			success: "✅ صورتك الرمزية جاهزة\nالشخصية: %1\nالمعرف: %2\nنص الخلفية: %3\nالتوقيع: %4\nاللون: %5",
			defaultColor: "افتراضي",
			error: "حدث خطأ\n%1: %2"
		}
	},
	badwords: {
		description: "تفعيل/تعطيل/إضافة/إزالة تحذيرات الكلمات البذيئة والمسيئة. إذا قام العضو بالمخالفة سيتم تحذيره، وفي المرة الثانية سيتم طرده من مجموعة الدردشة",
		guide: "   {pn} add <الكلمات>: إضافة كلمات محظورة (يمكنك إضافة عدة كلمات مفصولة بفاصلة \",\" أو خط عمودي \"|\")\n   {pn} delete <الكلمات>: حذف كلمات محظورة (يمكنك حذف عدة كلمات مفصولة بفاصلة \",\" أو خط عمودي \"|\")\n   {pn} list <hide | اتركه فارغاً>: عرض قائمة الكلمات المحظورة (أضف \"hide\" لإخفاء الكلمات المحظورة)\n   {pn} unwarn [<userID> | <@tag>]: إزالة تحذير واحد عن عضو معين\n   {pn} on: تشغيل نظام التحذيرات\n   {pn} off: إيقاف نظام التحذيرات",
		text: {
			onText: "مفعل",
			offText: "متوقف",
			onlyAdmin: "⚠️ | المشرفون فقط يمكنهم إضافة كلمات محظورة إلى القائمة",
			missingWords: "⚠️ | لم تقم بإدخال الكلمات المحظورة",
			addedSuccess: "✅ | تمت إضافة %1 كلمة محظورة إلى القائمة",
			alreadyExist: "❌ | %1 من الكلمات المحظورة موجودة بالفعل في القائمة مسبقاً: %2",
			tooShort: "⚠️ | %1 من الكلمات المحظورة لا يمكن إضافتها للقائمة لأن طولها أقل من حرفين: %2",
			onlyAdmin2: "⚠️ | المشرفون فقط يمكنهم حذف الكلمات المحظورة من القائمة",
			missingWords2: "⚠️ | لم تقم بإدخال الكلمات المراد حذفها",
			deletedSuccess: "✅ | تم حذف %1 كلمة محظورة من القائمة",
			notExist: "❌ | %1 من الكلمات المحظورة غير موجودة في القائمة مسبقاً: %2",
			emptyList: "⚠️ | قائمة الكلمات المحظورة في مجموعتك فارغة حالياً",
			badWordsList: "📑 | قائمة الكلمات المحظورة في مجموعتك: %1",
			onlyAdmin3: "⚠️ | المشرفون فقط يمكنهم %1 هذه الميزة",
			turnedOnOrOff: "✅ | تم جعل تحذير الكلمات المحظورة في حالة: %1",
			onlyAdmin4: "⚠️ | المشرفون فقط يمكنهم حذف تحذيرات الكلمات المحظورة",
			missingTarget: "⚠️ | لم تقم بإدخال معرف المستخدم أو عمل إشارة (Tag) له",
			notWarned: "⚠️ | المستخدم %1 لم يتم تحذيره بخصوص الكلمات المحظورة",
			removedWarn: "✅ | تم إزالة تحذير واحد للكلمات المحظورة عن المستخدم %1 | %2",
			warned: "⚠️ | تم رصد كلمات محظورة \"%1\" في رسالتك، إذا واصلت المخالفة فسوف يتم طردك من المجموعة.",
			warned2: "⚠️ | تم رصد كلمات محظورة \"%1\" في رسالتك، لقد خالفت مرتين وستتم طردك من المجموعة.",
			needAdmin: "يحتاج البوت إلى صلاحيات المشرف لطرد الأعضاء المخالفين",
			unwarned: "✅ | تم إزالة تحذير الكلمات المحظورة للمستخدم %1 | %2"
		}
	},
	balance: {
		description: "عرض رصيدك المالي أو رصيد الشخص الذي تشير إليه",
		guide: "   {pn}: لعرض رصيدك المالي\n   {pn} <@tag>: لعرض رصيد الشخص المشار إليه",
		text: {
			money: "لديك %1$",
			moneyOf: "يمتلك %1 مبلغ %2$"
		}
	},
	batslap: {
		description: "صورة صفع بالوطواط (Batslap)",
		text: {
			noTag: "يجب عليك الإشارة إلى الشخص الذي تريد صفعه"
		}
	},
	busy: {
		description: "تفعيل وضع عدم الإزعاج، وعندما يتم الإشارة إليك سيقوم البوت بإرسال تنبيه",
		guide: "   {pn} [فارغ | <السبب>]: تفعيل وضع عدم الإزعاج\n   {pn} off: إيقاف وضع عدم الإزعاج",
		text: {
			turnedOff: "✅ | تم إيقاف وضع عدم الإزعاج",
			turnedOn: "✅ | تم تفعيل وضع عدم الإزعاج",
			turnedOnWithReason: "✅ | تم تفعيل وضع عدم الإزعاج مع ذكر السبب: %1",
			alreadyOn: "المستخدم %1 مشغول حالياً",
			alreadyOnWithReason: "المستخدم %1 مشغول حالياً بسبب: %2"
		}
	},
	callad: {
		description: "إرسال تقرير، ملاحظات، أو بلاغ عن خطأ إلى مشرف البوت الأساسي",
		guide: "   {pn} <الرسالة>",
		text: {
			missingMessage: "الرجاء إدخال الرسالة التي تريد إرسالها إلى المشرف",
			sendByGroup: "\n- مُرسل من مجموعة: %1\n- معرف المجموعة (Thread ID): %2",
			sendByUser: "\n- مُرسل من المستخدم",
			content: "\n\nالمحتوى:\n─────────────────\n%1\n─────────────────\nقم بالرد على هذه الرسالة لإرسال رد إلى المستخدم",
			success: "تم إرسال رسالتك إلى المشرف بنجاح!",
			reply: "📍 رد من المشرف %1:\n─────────────────\n%2\n─────────────────\nقم بالرد على هذه الرسالة لمواصلة المراسلة مع المشرف",
			replySuccess: "تم إرسال ردك إلى المشرف بنجاح!",
			feedback: "📝 ملاحظة من المستخدم %1:\n- معرف المستخدم: %2%3\n\nالمحتوى:\n─────────────────\n%4\n─────────────────\nقم بالرد على هذه الرسالة لإرسال رد إلى المستخدم",
			replyUserSuccess: "تم إرسال ردك إلى المستخدم بنجاح!"
		}
	},
	cmd: {
		description: "إدارة ملفات الأوامر الخاصة بك",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <رابط> <اسم ملف الأمر>: تنزيل وتثبيت ملف أمر من رابط (رابط خام raw)",
		text: {
			missingFileName: "⚠️ | يرجى إدخال اسم الأمر الذي تريد إعادة تحميله",
			loaded: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedError: "❌ | فشل في تحميل الأمر \"%1\" مع حدوث خطأ\n%2: %3",
			loadedSuccess: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedFail: "❌ | فشل في تحميل الأمر \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | يرجى إدخال اسم الأمر الذي تريد إلغاء تحميله",
			unloaded: "✅ | تم إلغاء تحميل الأمر \"%1\" بنجاح",
			unloadedError: "❌ | فشل في إلغاء تحميل الأمر \"%1\" مع خطأ\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | يرجى إدخال الرابط أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | يرجى إدخال الرابط أو الكود لملف الأمر المراد تثبيته",
			missingFileNameInstall: "⚠️ | يرجى إدخال اسم الملف لحفظ الأمر (متبوعاً بامتداد .js)",
			invalidUrlOrCode: "⚠️ | تعذر الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود مسبقاً، هل أنت متأكد أنك تريد الكتابة فوق ملف الأمر القديم؟\nقم بالتفاعل (React) مع هذه الرسالة للمتابعة",
			installed: "✅ | تم تثبيت الأمر \"%1\" بنجاح، وتم حفظ ملف الأمر في %2",
			installedError: "❌ | فشل في تثبيت الأمر \"%1\" مع حدوث خطأ\n%2: %3",
			missingFile: "⚠️ | ملف الأمر \"%1\" غير موجود",
			invalidFileName: "⚠️ | اسم ملف الأمر غير صالح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	count: {
		description: "عرض عدد الرسائل لجميع الأعضاء أو لنفسك (منذ انضمام البوت إلى المجموعة)",
		guide: "   {pn}: يستخدم لعرض عدد رسائلك الخاصة\n   {pn} @tag: يستخدم لعرض عدد رسائل الأشخاص المشار إليهم\n   {pn} all: يستخدم لعرض عدد رسائل جميع الأعضاء",
		text: {
			count: "عدد رسائل الأعضاء:",
			endMessage: "الأشخاص الذين ليس لديهم اسم في القائمة لم يرسلوا أي رسائل بعد.",
			page: "الصفحة [%1/%2]",
			reply: "قم بالرد على هذه الرسالة برقم الصفحة لعرض المزيد",
			result: "%1 في المرتبة %2 مع %3 رسالة",
			yourResult: "أنت في المرتبة %1 وقمت بإرسال %2 رسالة في هذه المجموعة",
			invalidPage: "رقم الصفحة غير صالح"
		}
	},
	customrankcard: {
		description: "تصميم بطاقة المستوى (Rank Card) الخاصة بك بنفسك",
		guide: {
			body: "   {pn} [maincolor | subcolor | linecolor | progresscolor | alphasubcolor | textcolor | namecolor | expcolor | rankcolor | levelcolor | reset] <القيمة>"
				+ "\n   حيث أن:"
				+ "\n  + maincolor | background <القيمة>: الخلفية الرئيسية لبطاقة المستوى"
				+ "\n  + subcolor <القيمة>: الخلفية الفرعية"
				+ "\n  + linecolor <القيمة>: لون الخط الفاصل بين الخلفية الرئيسية والفرعية"
				+ "\n  + expbarcolor <القيمة>: لون شريط الخبرة (EXP)"
				+ "\n  + progresscolor <القيمة>: لون شريط التقدم الحالي للخبرة"
				+ "\n  + alphasubcolor <القيمة>: شفافة الخلفية الفرعية (من 0 إلى 1)"
				+ "\n  + textcolor <القيمة>: لون النص (كود لون سداسي Hex أو rgba)"
				+ "\n  + namecolor <القيمة>: لون الاسم"
				+ "\n  + expcolor <القيمة>: لون نقاط الخبرة"
				+ "\n  + rankcolor <القيمة>: لون المرتبة (Rank)"
				+ "\n  + levelcolor <القيمة>: لون المستوى (Level)"
				+ "\n    • <القيمة> يمكن أن تكون كود سداسي للون، rgb، rgba، تدرج لوني (gradient، بحيث يفصل بين كل لون مسافة)، أو رابط صورة"
				+ "\n    • إذا كنت تريد استخدام التدرج اللوني، يرجى إدخال عدة ألوان تفصل بينها مسافات"
				+ "\n   {pn} reset: إعادة تعيين كل شيء إلى الوضع الافتراضي"
				+ "\n   مثال:"
				+ "\n    {pn} maincolor #fff000"
				+ "\n    {pn} subcolor rgba(255,136,86,0.4)"
				+ "\n    {pn} reset",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_1.jpg`]: "https://i.ibb.co/BZ2Qgs1/image.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_2.png`]: "https://i.ibb.co/wy1ZHHL/image.png"
			}
		},
		text: {
			invalidImage: "رابط الصورة غير صالح، يرجى اختيار رابط ينتهي بصيغة صورة (jpg, jpeg, png, gif)، يمكنك رفع الصورة على موقع https://imgbb.com/ واختيار \"الحصول على الرابط المباشر\" للحصول على رابط الصورة",
			invalidAttachment: "مرفق غير صالح، يرجى اختيار ملف صورة",
			invalidColor: "كود اللون غير صالح، يرجى اختيار كود لون سداسي (من 6 أرقام) أو كود لون بصيغة rgba",
			notSupportImage: "رابط الصورة غير مدعوم مع الخيار \"%1\"",
			success: "تم حفظ التغييرات الخاصة بك، وإليك معاينة لها",
			reseted: "تمت إعادة تعيين جميع الإعدادات إلى الوضع الافتراضي",
			invalidAlpha: "يرجى اختيار رقم من 0 إلى 1"
		}
	},
	dhbc: {
		description: "لعب لعبة (امسك الكلمة / حل الألغاز)",
		guide: "{pn}",
		text: {
			reply: "يرجى الرد على هذه الرسالة بالإجابة الصحيحة\n%1",
			isSong: "هذا هو اسم الأغنية الخاصة بالمطرب %1",
			notPlayer: "⚠️ أنت لست اللاعب لهذه السؤال الحالي",
			correct: "🎉 تهانينا، لقد أجبت بشكل صحيح وتلقيت %1$",
			wrong: "⚠️ لقد أجبت بشكل خاطئ"
		}
	},
	emojimix: {
		description: "دمج رمزين تعبيريين (إيموجي) معاً",
		guide: "   {pn} <إيموجي 1> <إيموجي 2>\n   مثال:  {pn} 🤣 🥰"
	},
	eval: {
		description: "اختبار الأكواد البرمجية بشكل سريع",
		guide: "{pn} <الكود المراد اختباره>",
		text: {
			error: "❌ حدث خطأ أثناء التنفيذ:"
		}
	},
	event: {
		description: "إدارة ملفات أوامر الأحداث (Event commands) الخاصة بك",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <رابط> <اسم ملف الأمر>: تنزيل وتحميل أمر الحدث، الرابط هو مسار ملف الأمر (raw)",
		text: {
			missingFileName: "⚠️ | يرجى إدخال اسم الأمر الذي تريد إعادة تحميله",
			loaded: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل أمر الحدث \"%1\" مع حدوث خطأ\n%2: %3",
			loadedSuccess: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل أمر الحدث \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | يرجى إدخال اسم الأمر الذي تريد إلغاء تحميله",
			unloaded: "✅ | تم إلغاء تحميل أمر الحدث \"%1\" بنجاح",
			unloadedError: "❌ | فشل في إلغاء تحميل أمر الحدث \"%1\" مع خطأ\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | يرجى إدخال الرابط أو الكود واسم ملف الأمر المراد تثبيته",
			missingUrlOrCode: "⚠️ | يرجى إدخال الرابط أو الكود لملف الأمر المراد تثبيته",
			missingFileNameInstall: "⚠️ | يرجى إدخال اسم الملف لحفظ الأمر (متبوعاً بامتداد .js)",
			invalidUrlOrCode: "⚠️ | تعذر الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود مسبقاً، هل أنت متأكد أنك تريد الكتابة فوق ملف الأمر القديم؟\nقم بالتفاعل مع هذه الرسالة للمتابعة",
			installed: "✅ | تم تثبيت أمر الحدث \"%1\" بنجاح، وتم حفظ ملف الأمر في %2",
			installedError: "❌ | فشل تثبيت أمر الحدث \"%1\" مع خطأ\n%2: %3",
			missingFile: "⚠️ | الملف \"%1\" غير موجود",
			invalidFileName: "⚠️ | اسم الملف غير صالح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	filteruser: {
		description: "تصفية أعضاء المجموعة حسب عدد الرسائل أو الحسابات المعطلة/المحظورة",
		guide: "   {pn} [<عدد الرسائل> | die (للمعطلة)]",
		text: {
			needAdmin: "⚠️ | يرجى إضافة البوت كمسؤول (مشرف) في المجموعة لاستخدام هذا الأمر",
			confirm: "⚠️ | هل أنت متأكد أنك تريد حذف أعضاء المجموعة الذين لديهم أقل من %1 رسالة؟\nتفاعل مع هذه الرسالة للتأكيد",
			kickByBlock: "✅ | تم بنجاح حذف %1 من الأعضاء ذوي الحسابات المعطلة",
			kickByMsg: "✅ | تم بنجاح حذف %1 من الأعضاء الذين لديهم أقل من %2 رسالة",
			kickError: "❌ | حدث خطأ ولم يتمكن البوت من طرد %1 من الأعضاء:\n%2",
			noBlock: "✅ | لا توجد حسابات أعضاء معطلة",
			noMsg: "✅ | لا يوجد أعضاء لديهم أقل من %1 رسالة"
		}
	},
	getfbstate: {
		description: "الحصول على ملف حالة الحساب (fbstate) الحالي",
		guide: "{pn}",
		text: {
			success: "تم إرسال ملف fbstate إليك، يرجى التحقق من رسائل البوت الخاصة (الخاص)"
		}
	},
	grouptag: {
		description: "الإشارة إلى الأعضاء حسب مجموعات مخصصة (Group Tag)",
		guide: "   {pn} add <اسم مجموعة الإشارة> <@tags>: يستخدم لإنشاء مجموعة إشارة جديدة أو إضافة أعضاء إليها\n   مثال:\n    {pn} TEAM1 @tag1 @tag2\n\n   {pn} del <اسم مجموعة الإشارة> <@tags>: يستخدم لإزالة أعضاء من مجموعة الإشارة\n   مثال:\n    {pn} del TEAM1 @tag1 @tag2\n\n   {pn} remove <اسم مجموعة الإشارة>: يستخدم لحذف مجموعة الإشارة بالكامل\n   مثال:\n    {pn} remove TEAM1\n\n   {pn} rename <اسم مجموعة الإشارة القديم> | <الاسم الجديد>: لإعادة تسمية مجموعة الإشارة\n\n   {pn} [list | all]: لعرض قائمة مجموعات الإشارة في مجموعتك\n   {pn} info <اسم مجموعة الإشارة>: لعرض معلومات مجموعة الإشارة",
		text: {
			noGroupTagName: "يرجى إدخال اسم مجموعة الإشارة",
			noMention: "لم تقم بالإشارة إلى أي عضو لإضافته إلى مجموعة الإشارة",
			addedSuccess: "تمت إضافة الأعضاء:\n%1\nإلى مجموعة الإشارة \"%2\"",
			addedSuccess2: "تم إنشاء مجموعة الإشارة \"%1\" بالأعضاء:\n%2",
			existedInGroupTag: "الأعضاء:\n%1\nموجودون بالفعل في مجموعة الإشارة \"%2\"",
			notExistedInGroupTag: "الأعضاء:\n%1\nغير موجودين في مجموعة الإشارة \"%2\"",
			noExistedGroupTag: "مجموعة الإشارة \"%1\" غير موجودة في دردشة مجموعتك",
			noExistedGroupTag2: "لم تقم مجموعتك بإضافة أي مجموعة إشارة بعد",
			noMentionDel: "يرجى الإشارة إلى الأعضاء المراد إزالتهم من مجموعة الإشارة \"%1\"",
			deletedSuccess: "تم حذف الأعضاء:\n%1\nمن مجموعة الإشارة \"%2\"",
			deletedSuccess2: "تم حذف مجموعة الإشارة \"%1\"",
			tagged: "الإشارة إلى مجموعة \"%1\":\n%2",
			noGroupTagName2: "يرجى إدخال اسم مجموعة الإشارة القديم والجديد مفصولين بـ \"|\"",
			renamedSuccess: "تمت إعادة تسمية مجموعة الإشارة من \"%1\" إلى \"%2\"",
			infoGroupTag: "📑 | اسم المجموعة: \"%1\"\n👥 | عدد الأعضاء: %2\n👨‍👩‍👧‍👦 | قائمة الأعضاء:\n %3"
		}
	},
	help: {
		description: "عرض طريقة استخدام الأوامر",
		guide: "{pn} [فارغ | <رقم الصفحة> | <اسم الأمر>]",
		text: {
			help: "╭─────────────⭓\n%1\n├─────⭔\n│ الصفحة [ %2/%3 ]\n│ يحتوي البوت حالياً على %4 أوامر قابلة للاستخدام\n│ » اكتب %5help <الصفحة> لعرض قائمة الأوامر\n│ » اكتب %5help لعرض تفاصيل كيفية استخدام أمر معين\n├────────⭔\n│ %6\n╰─────────────⭓",
			help2: "%1├───────⭔\n│ » يحتوي البوت حالياً على %2 أوامر متاحة للاستخدام\n│ » اكتب %3help <اسم الأمر> لعرض تفاصيل طريقة استخدامه\n│ %4\n╰─────────────⭓",
			commandNotFound: "الأمر \"%1\" غير موجود",
			getInfoCommand: "╭── الاسم ────⭓\n│ %1\n├── المعلومات\n│ الوصف: %2\n│ الأسماء الأخرى: %3\n│ الأسماء الأخرى في مجموعتك: %4\n│ الإصدار: %5\n│ الرتبة المطلوبة: %6\n│ وقت الانتظار لكل أمر: %7 ثانية\n│ المطور/المنشئ: %8\n├── طريقة الاستخدام\n%9\n├── ملاحظات\n│ المحتوى داخل <XXXXX> يمكن تغييره\n│ المحتوى داخل [a|b|c] يعني خيار من الخيارات (a أو b أو c)\n╰──────⭔",
			doNotHave: "لا يوجد",
			roleText0: "0 (جميع المستخدمين)",
			roleText1: "1 (مشرفو المجموعة)",
			roleText2: "2 (مشرف البوت)",
			roleText0setRole: "0 (تعيين الرتبة، جميع المستخدمين)",
			roleText1setRole: "1 (تعيين الرتبة، مشرفو المجموعة)",
			pageNotFound: "الصفحة %1 غير موجودة"
		}
	},
	kick: {
		description: "طرد عضو من مجموعة الدردشة",
		guide: "{pn} @tags: يستخدم لطرد الأعضاء الذين تتم الإشارة إليهم"
	},
	loadconfig: {
		description: "إعادة تحميل ملف إعدادات البوت (Config)"
	},
	moon: {
		description: "عرض صورة القمر في الليلة التي تحددها (يوم/شهر/سنة)",
		guide: "  {pn} <اليوم/الشهر/السنة>\n   {pn} <اليوم/الشهر/السنة> <التسمية التوضيحية>",
		text: {
			invalidDateFormat: "يرجى إدخال تاريخ صالح بالصيغة DD/MM/YYYY",
			error: "حدث خطأ أثناء جلب صورة القمر لتاريخ %1",
			invalidDate: "%1 ليس تاريخاً صالحاً",
			caption: "- صورة القمر بتاريخ %1"
		}
	},
	notification: {
		description: "إرسال إشعار من المشرف إلى جميع المجموعات",
		guide: "{pn} <الرسالة>",
		text: {
			missingMessage: "يرجى إدخال الرسالة التي تريد إرسالها إلى جميع المجموعات",
			notification: "إشعار من مشرف البوت إلى جميع مجموعات الدردشة (لا تقم بالرد على هذه الرسالة)",
			sendingNotification: "البدء في إرسال الإشعار من مشرف البوت إلى %1 مجموعة",
			sentNotification: "✅ تم إرسال الإشعار إلى %1 مجموعة بنجاح",
			errorSendingNotification: "حدث خطأ أثناء الإرسال إلى %1 مجموعة:\n %2"
		}
	},
	prefix: {
		description: "تغيير بادئة الأوامر (Prefix) الخاصة بالبوت في مجموعتك أو في نظام البوت بالكامل (لمشرفي البوت فقط)",
		guide: "   {pn} <البادئة الجديدة>: لتغيير البادئة الجديدة في مجموعتك\n   مثال:\n    {pn} #\n\n   {pn} <البادئة الجديدة> -g: لتغيير بادئة النظام بالكامل (لمشرفي البوت فقط)\n   مثال:\n    {pn} # -g\n\n   {pn} reset: لإعادة تعيين البادئة في مجموعتك إلى الوضع الافتراضي",
		text: {
			reset: "تمت إعادة تعيين البادئة الخاصة بك إلى الوضع الافتراضي: %1",
			onlyAdmin: "مشرفو البوت فقط يمكنهم تغيير البادئة الخاصة بنظام البوت",
			confirmGlobal: "يرجى التفاعل مع هذه الرسالة لتأكيد تغيير بادئة نظام البوت",
			confirmThisThread: "يرجى التفاعل مع هذه الرسالة لتأكيد تغيير البادئة في مجموعتك",
			successGlobal: "تم تغيير بادئة النظام إلى: %1",
			successThisThread: "تم تغيير بادئة مجموعتك إلى: %1",
			myPrefix: "🌐 بادئة النظام: %1\n🛸 بادئة مجموعة الدردشة الخاصة بك: %2"
		}
	},
	rank: {
		description: "عرض مستواك أو مستوى الشخص الذي تشير إليه. يمكنك الإشارة لعدة أشخاص"
	},
	rankup: {
		description: "تفعيل أو تعطيل إشعارات الارتقاء بالمستوى (Level Up)",
		guide: "{pn} [on | off]",
		text: {
			syntaxError: "خطأ في بناء الجملة، استخدم فقط {pn} on أو {pn} off",
			turnedOn: "تم تفعيل إشعارات الارتقاء بالمستوى",
			turnedOff: "تم تعطيل إشعارات الارتقاء بالمستوى",
			notiMessage: "🎉🎉 تهانينا لقد وصلت إلى المستوى %1"
		}
	},
	refresh: {
		description: "تحديث معلومات مجموعة الدردشة أو المستخدم",
		guide: "   {pn} [thread | group]: تحديث معلومات مجموعة الدردشة الخاصة بك\n   {pn} group <threadID>: تحديث معلومات مجموعة دردشة باستخدام المعرف\n\n   {pn} user: تحديث معلومات المستخدم الخاص بك\n   {pn} user [<userID> | @tag]: تحديث معلومات مستخدم باستخدام المعرف أو الإشارة",
		text: {
			refreshMyThreadSuccess: "✅ | تم تحديث معلومات مجموعة الدردشة الخاصة بك بنجاح!",
			refreshThreadTargetSuccess: "✅ | تم تحديث معلومات مجموعة الدردشة %1 بنجاح!"
		}
	},
	rules: {
		description: "إنشاء/عرض/إضافة/تعديل/تغيير ترتيب/حذف قوانين المجموعة الخاصة بك",
		guide: "   {pn} [add | -a] <القانون المراد إضافته>: إضافة قانون للمجموعة.\n   {pn}: عرض قوانين المجموعة.\n   {pn} [edit | -e] <رقم القانون> <المحتوى الجديد>: تعديل القانون رقم n.\n   {pn} [move | -m] <رقم1> <رقم2>: تبديل مكان القانون رقم <رقم1> و <رقم2>.\n   {pn} [delete | -d] <رقم القانون>: حذف القانون رقم n.\n   {pn} [remove | -r]: حذف كافة قوانين المجموعة.\n\n   مثال:\n    {pn} add ممنوع السبام\n    {pn} move 1 3\n    {pn} -e 1 ممنوع نشر الرسائل المكررة في المجموعة\n    {pn} -r"
	},
	sendnoti: {
		description: "إنشاء وإرسال إشعارات إلى المجموعات التي تديرها",
		guide: "   {pn} create <اسم المجموعة>: إنشاء مجموعة إشعارات جديدة باسم <اسم المجموعة>\n   مثال:\n    {pn} create TEAM1\n\n   {pn} add <اسم المجموعة>: إضافة مجموعتك الحالية إلى مجموعة الإشعارات <اسم المجموعة> (يجب أن تكون مشرفاً في هذه المجموعة)\n   مثال:\n    {pn} add TEAM1\n\n   {pn} delete: إزالة مجموعتك الحالية من مجموعة الإشعارات\n   مثال:\n    {pn} delete TEAM1\n\n   {pn} send <اسم المجموعة> | <الرسالة>: إرسال إشعار لجميع المجموعات في مجموعة الإشعارات المحددة\n   مثال:\n    {pn} send TEAM1 | السلام عليكم\n\n   {pn} remove <اسم المجموعة>: حذف مجموعة الإشعارات (يجب أن تكون منشئها)",
		text: {
			missingGroupName: "يرجى إدخال اسم مجموعة الإشعارات (groupNoti)",
			groupNameExists: "تم إنشاء مجموعة إشعارات بهذا الاسم %1 من قبلك مسبقاً، يرجى اختيار اسم آخر",
			createdGroup: "تم إنشاء مجموعة الإشعارات بنجاح:\n- الاسم: %1\n- المعرف: %2",
			missingGroupNameToAdd: "يرجى إدخال اسم مجموعة الإشعارات التي تريد إضافة هذه المجموعة إليها",
			groupNameNotExists: "لم تقم بإنشاء أو إدارة أي مجموعة إشعارات بالاسم: %1",
			notAdmin: "أنت لست مشرفاً في مجموعة الدردشة هذه",
			added: "تمت إضافة مجموعة الدردشة الحالية إلى مجموعة الإشعارات: %1",
			missingGroupNameToDelete: "يرجى إدخال اسم مجموعة الإشعارات التي تريد إزالة هذه المجموعة منها",
			notInGroup: "مجموعة الدردشة الحالية ليست في مجموعة الإشعارات %1",
			deleted: "تم حذف مجموعة الدردشة الحالية من مجموعة الإشعارات: %1",
			failed: "فشل إرسال الإشعار إلى %1 من مجموعات الدردشة: \n%2",
			missingGroupNameToRemove: "يرجى إدخال اسم مجموعة الإشعارات التي تريد إزالتها",
			removed: "تم حذف مجموعة الإشعارات: %1",
			missingGroupNameToSend: "يرجى إدخال اسم مجموعة الإشعارات التي تريد إرسال الرسالة إليها",
			groupIsEmpty: "مجموعة الإشعارات \"%1\" فارغة",
			sending: "جاري إرسال الإشعار إلى %1 من مجموعات الدردشة",
			success: "تم إرسال الإشعار إلى %1 مجموعة في مجموعة الإشعارات \"%2\" بنجاح",
			notAdminOfGroup: "أنت لست مشرفاً في هذه المجموعة",
			missingGroupNameToView: "يرجى إدخال اسم مجموعة الإشعارات التي تريد عرض معلوماتها",
			groupInfo: "- اسم المجموعة: %1\n - المعرف: %2\n - تاريخ الإنشاء: %3\n%4 ",
			groupInfoHasGroup: "- تحتوي على مجموعات الدردشة: \n%1",
			noGroup: "لم تقم بإنشاء أو إدارة أي مجموعة إشعارات"
		}
	},
	setalias: {
		description: "إضافة اسم مستعار (اختصار) لأي أمر في مجموعتك",
		guide: "  يستخدم هذا الأمر لإضافة/إزالة اسم مستعار لأي أمر في مجموعتك\n   {pn} add <الاسم المستعار> <اسم الأمر>: إضافة اسم مستعار للأمر في مجموعتك\n   {pn} add <الاسم المستعار> <اسم الأمر> -g: إضافة اسم مستعار للأمر على مستوى النظام بالكامل (لمشرفي البوت فقط)\nمثال:\n    {pn} add ctrk customrankcard\n\n   {pn} [remove | rm] <الاسم المستعار> <اسم الأمر>: إزالة اسم مستعار للأمر في مجموعتك\n   {pn} [remove | rm] <الاسم المستعار> <اسم الأمر> -g: إزالة اسم مستعار على مستوى النظام بالكامل (لمشرفي البوت فقط)\nمثال:\n    {pn} rm ctrk customrankcard\n\n   {pn} list: لعرض قائمة جميع الأسماء المستعارة للأوامر في مجموعتك\n   {pn} list -g: لعرض جميع الأسماء المستعارة على مستوى النظام بالكامل"
	},
	setavt: {
		description: "تغيير الصورة الرمزية (Avatar) الخاصة بالبوت",
		text: {
			cannotGetImage: "❌ | حدث خطأ أثناء جلب رابط الصورة",
			invalidImageFormat: "❌ | صيغة الصورة غير صالحة",
			changedAvatar: "✅ | تم تغيير صورة البوت بنجاح"
		}
	},
	setlang: {
		description: "تعيين اللغة الافتراضية للبوت للدردشة الحالية أو لجميع الدردشات",
		guide: "   {pn} <كود اللغة ISO 639-1>\n   مثال:    {pn} en    {pn} vi    {pn} ja",
		text: {
			setLangForAll: "تم تعيين اللغة الافتراضية لجميع الدردشات: %1",
			setLangForCurrent: "تم تعيين اللغة الافتراضية للدردشة الحالية: %1",
			noPermission: "مشرفو البوت فقط يمكنهم استخدام هذا الأمر"
		}
	},
	setleave: {
		description: "تعديل محتوى/تفعيل/تعطيل رسالة المغادرة عندما يغادر عضو مجموعة الدردشة الخاصة بك",
		guide: {
			body: "   {pn} on: تفعيل رسالة المغادرة\n   {pn} off: إيقاف رسالة المغادرة\n   {pn} text [<المحتوى> | reset]: تعديل محتوى النص أو إعادة تعيينه للافتراضي، مع الاختصارات المتاحة:\n  + {userName}: اسم العضو الذي غادر المجموعة\n  + {userNameTag}: اسم العضو الذي غادر المجموعة (مع إشارة Tag)\n  + {boxName}: اسم مجموعة الدردشة\n  + {type}: غادر / تم طرده من قبل المشرف\n  + {session}: وقت اليوم (صباحاً، مساءً.. إلخ)\n\n   مثال:\n    {pn} text العضو {userName} قد {type} المجموعة، نتمنى لك التوفيق 🤧\n\n   قم بالرد (Reply) أو إرسال رسالة مع ملف بالمحتوى {pn} file: لإضافة ملف مرفق لرسالة المغادرة (صورة، فيديو، صوت)\n\nمثال:\n   {pn} file reset: إعادة تعيين الملف",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setleave/setleave_en_1.png`]: "https://i.ibb.co/2FKJHJr/guide1.png"
			}
		},
		text: {
			missingContent: "يرجى إدخال محتوى الرسالة",
			edited: "تم تعديل محتوى رسالة المغادرة لمجموعتك إلى:\n%1",
			reseted: "تمت إعادة تعيين محتوى رسالة المغادرة",
			noFile: "لا يوجد ملف مرفق لرسالة المغادرة لإعادة تعيينه",
			resetedFile: "تم إعادة تعيين ملف مرفق رسالة المغادرة بنجاح",
			missingFile: "يرجى الرد على هذه الرسالة بملف صورة / فيديو / صوت",
			addedFile: "تمت إضافة %1 من الملفات المرفقة إلى رسالة المغادرة الخاصة بك"
		}
	},
	setname: {
		description: "تغيير لقب جميع الأعضاء في الدردشة أو الأعضاء المشار إليهم بصيغة محددة",
		guide: {
			body: "   {pn} <اللقب الجديد>: تغيير لقبك الخاص\n   {pn} @tags <اللقب الجديد>: تغيير ألقاب الأعضاء المشار إليهم\n   {pn} all <اللقب الجديد>: تغيير ألقاب جميع الأعضاء في الدردشة\n\nمع الاختصارات المتاحة:\n   + {userName}: اسم العضو\n   + {userID}: معرف العضو\n\n   مثال: (انظر الصورة)",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_1.png`]: "https://i.ibb.co/gFh23zb/guide1.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_2.png`]: "https://i.ibb.co/BNWHKgj/guide2.png"
			}
		},
		text: {
			error: "حدث خطأ، جرب إيقاف ميزة رابط الانضمام في المجموعة ثم حاول مرة أخرى"
		}
	},
	setrole: {
		description: "تعديل رتبة الصلاحية للأمر (الأوامر ذات الرتبة < 2)",
		guide: "   {pn} <اسم الأمر> <الرتبة الجديدة>: تعيين رتبة جديدة للأمر\n   حيث أن:\n   + <اسم الأمر>: اسم الأمر\n   + <الرتبة الجديدة>: الرتبة الجديدة للأمر بحيث:\n   + <الرتبة الجديدة> = 0: يمكن استخدام الأمر من قبل جميع الأعضاء في المجموعة\n   + <الرتبة الجديدة> = 1: يمكن استخدام الأمر من قبل المشرفين فقط\n   + <الرتبة الجديدة> = default: إعادة تعيين رتبة الأمر إلى الوضع الافتراضي\n   مثال:\n    {pn} rank 1: (أمر الرتبة يمكن استخدامه من قبل المشرفين فقط)\n    {pn} rank 0: (أمر الرتبة يمكن استخدامه من قبل الجميع)\n    {pn} rank default: إعادة تعيين للافتراضي\n—————\n   {pn} [viewrole|view|show]: عرض رتب الأوامر المعدلة",
		text: {
			noEditedCommand: "✅ لا تحتوي مجموعتك على أي أوامر معدلة الصلاحيات",
			editedCommand: "⚠️ مجموعتك تحتوي على أوامر معدلة الصلاحيات:\n",
			noPermission: "❗ المشرفون فقط يمكنهم استخدام هذا الأمر",
			commandNotFound: "الأمر \"%1\" غير موجود",
			noChangeRole: "❗ لا يمكن تغيير رتبة الصلاحية للأمر \"%1\"",
			resetRole: "تمت إعادة تعيين رتبة الأمر \"%1\" إلى الوضع الافتراضي",
			changedRole: "تم تغيير رتبة الأمر \"%1\" إلى %2"
		}
	},
	setwelcome: {
		description: "تعديل محتوى رسالة الترحيب عند انضمام عضو جديد إلى مجموعة الدردشة الخاصة بك",
		guide: {
			body: "   {pn} text [<المحتوى> | reset]: تعديل محتوى النص أو إرجاعه للوضع الافتراضي، مع بعض الاختصارات:\n  + {userName}: اسم العضو الجديد\n  + {userNameTag}: اسم العضو الجديد (مع إشارة Tag)\n  + {boxName}: اسم مجموعة الدردشة\n  + {multiple}: أنت (للمفرد) || أنتم (للجمع)\n  + {session}: وقت اليوم\n\n   مثال:\n    {pn} text أهلاً بك {userName}، نورت مجموعة {boxName}، نتمنى لك وقتاً ممتعاً {multiple}\n\n   قم بالرد (Reply) أو إرسال رسالة مع ملف بالمحتوى {pn} file: لإضافة ملفات مرفقة لرسالة الترحيب (صورة، فيديو، صوت)\n\n   مثال:\n    {pn} file reset: حذف الملفات المرفقة",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setwelcome/setwelcome_en_1.png`]: "https://i.ibb.co/vsCz0ks/setwelcome-en-1.png"
			}
		},
		text: {
			missingContent: "يرجى إدخال محتوى رسالة الترحيب",
			edited: "تم تعديل محتوى رسالة الترحيب لمجموعتك إلى: %1",
			reseted: "تمت إعادة تعيين محتوى رسالة الترحيب",
			noFile: "لا توجد ملفات مرفقة للحذف",
			resetedFile: "تمت إعادة تعيين الملفات المرفقة بنجاح",
			missingFile: "يرجى الرد على هذه الرسالة بملف صورة / فيديو / صوت",
			addedFile: "تمت إضافة %1 من الملفات المرفقة إلى رسالة الترحيب الخاصة بمجموعتك"
		}
	},
	shortcut: {
		description: "إضافة اختصار (Shortcut) لرسالة في مجموعة الدردشة الخاصة بك",
		text: {
			missingContent: 'يرجى إدخال محتوى الرسالة',
			shortcutExists: 'الاختصار "%1" موجود بالفعل، تفاعل مع هذه الرسالة لاستبدال محتوى الاختصار',
			shortcutExistsByOther: 'تم إضافة الاختصار %1 بواسطة عضو آخر، يرجى تجربة كلمة مفتاحية أخرى',
			added: 'تمت إضافة الاختصار %1 => %2',
			addedAttachment: ' مع %1 من المرفقات',
			missingKey: 'يرجى إدخال الكلمة المفتاحية للاختصار الذي تريد حذفه',
			notFound: 'لم يتم العثور على اختصار للكلمة المفتاحية %1 في دردشة مجموعتك',
			onlyAdmin: 'المشرفون فقط هم من يمكنهم حذف اختصارات الأشخاص الآخرين',
			deleted: 'تم حذف الاختصار %1',
			empty: 'لم تقم مجموعة الدردشة الخاصة بك بإضافة أي اختصارات بعد',
			message: 'الرسالة',
			attachment: 'المرفق',
			list: 'قائمة الاختصارات الخاصة بك',
			onlyAdminRemoveAll: 'المشرفون فقط هم من يمكنهم إزالة جميع الاختصارات في مجموعة الدردشة',
			confirmRemoveAll: 'هل أنت متأكد أنك تريد إزالة جميع الاختصارات في مجموعة الدردشة هذه؟ (تفاعل مع هذه الرسالة للتأكيد)',
			removedAll: 'تمت إزالة جميع الاختصارات في دردشة مجموعتك'
		}
	},
	simsimi: {
		description: "الدردشة مع سيمسيما (Simsimi)",
		guide: "   {pn} [on | off]: تشغيل / إيقاف سيمسيما\n\n   {pn} <كلمة>: التحدث مع سيمسيما\n   مثال:\n    {pn} hi",
		text: {
			turnedOn: "تم تشغيل سيمسيما بنجاح!",
			turnedOff: "تم إيقاف سيمسيما بنجاح!",
			chatting: "جاري الدردشة مع سيمسيما...",
			error: "سيمسيما مشغول حالياً، يرجى المحاولة مرة أخرى لاحقاً"
		}
	},
	sorthelp: {
		description: "فرز قائمة المساعدة (Help)",
		guide: "{pn} [name (بالاسم) | category (بالفئة)]",
		text: {
			savedName: "تم حفظ فرز قائمة المساعدة حسب الاسم",
			savedCategory: "تم حفظ فرز قائمة المساعدة حسب الفئة"
		}
	},
	thread: {
		description: "إدارة مجموعات الدردشة في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث عن مجموعة دردشة في بيانات البوت بالاسم\n   {pn} [find | -f | search | -s] [-j | joined] <الاسم للبحث>: البحث عن مجموعة دردشة لا يزال البوت منضمًا إليها بالاسم\n   {pn} [ban | -b] [<tid> | اتركه فارغاً] <السبب>: لحظر مجموعة بالمعرف <tid> أو المجموعة الحالية التي تستخدم البوت\n   مثال:\n    {pn} ban 3950898668362484 spam bot\n    {pn} ban spam too much\n    {pn} unban [<tid> | اتركه فارغاً] لإلغاء حظر مجموعة بالمعرف tid أو المجموعة الحالية",
		text: {
			noPermission: "ليس لديك صلاحية لاستخدام هذه الميزة",
			found: "🔎 تم العثور على %1 مجموعة مطابقة للكلمة المفتاحية \"%3\" في بيانات البوت:\n%3",
			notFound: "❌ لم يتم العثور على أي مجموعة مطابقة للكلمة المفتاحية: \"%1\" في بيانات البوت",
			hasBanned: "المجموعة ذات المعرف [%1 | %2] محظورة مسبقاً:\n» السبب: %3\n» الوقت: %4",
			banned: "تم حظر المجموعة ذات المعرف [%1 | %2] من استخدام البوت.\n» السبب: %3\n» الوقت: %4",
			notBanned: "المجموعة ذات المعرف [%1 | %2] ليست محظورة من استخدام البوت",
			unbanned: "تم إلغاء حظر المجموعة ذات المعرف tid [%1 | %2] من استخدام البوت",
			missingReason: "لا يمكن ترك سبب الحظر فارغاً",
			info: "» معرف المجموعة (Box ID): %1\n» الاسم: %2\n» تاريخ إنشاء البيانات: %3\n» إجمالي الأعضاء: %4\n» ذكور: %5 عضو\n» إناث: %6 عضوة\n» إجمالي الرسائل: %7%8"
		}
	},
	tid: {
		description: "عرض معرف مجموعة الدردشة الخاصة بك (Thread ID)",
		guide: "{pn}"
	},
	tik: {
		description: "تنزيل فيديو / شرائح صور (Slide)، أو صوت من روابط تيك توك (TikTok)",
		guide: "   {pn} [video|-v|v] <الرابط>: لتنزيل فيديو أو شرائح صور من رابط تيك توك.\n   {pn} [audio|-a|a] <الرابط>: لتنزيل الصوت من رابط تيك توك",
		text: {
			invalidUrl: "يرجى إدخال رابط تيك توك صالح",
			downloadingVideo: "جاري تنزيل الفيديو: %1...",
			downloadedSlide: "تم تنزيل الشرائح: %1\n%2",
			downloadedVideo: "تم تنزيل الفيديو: %1\nرابط التنزيل: %2",
			downloadingAudio: "جاري تنزيل الملف الصوتي: %1...",
			downloadedAudio: "تم تنزيل الملف الصوتي: %1"
		}
	},
	trigger: {
		description: "تفعيل تأثير الصورة (Trigger image)",
		guide: "{pn} [@tag | فارغ]"
	},
	uid: {
		description: "عرض معرف المستخدم في فيسبوك (Facebook User ID)",
		guide: "   {pn}: لعرض معرف فيسبوك الخاص بك\n   {pn} @tag: لعرض معرف فيسبوك للشخص المشار إليه\n   {pn} <رابط البروفيل>: لعرض معرف فيسبوك لرابط بروفيل معين",
		text: {
			syntaxError: "يرجى الإشارة إلى الشخص الذي تريد معرفة معرفه (uid) أو ترك الحقل فارغاً لعرض معرفك الخاص"
		}
	},
	unsend: {
		description: "إلغاء إرسال رسالة البوت (حذفها)",
		guide: "قم بالرد (Reply) على الرسالة التي تريد إلغاء إرسالها واستدعاء الأمر {pn}",
		text: {
			syntaxError: "يرجى الرد على الرسالة التي تريد إلغاء إرسالها"
		}
	},
	user: {
		description: "إدارة المستخدمين في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث عن المستخدمين في بيانات البوت بالاسم\n\n   {pn} [ban | -b] [<uid> | @tag | الرد على الرسالة] <السبب>: لحظر مستخدم بالمعرف <uid> أو المستخدم المشار إليه أو مرسل الرسالة التي تم الرد عليها باستخدام البوت\n\n   {pn} unban [<uid> | @tag | الرد على الرسالة]: لإلغاء حظر مستخدم باستخدام البوت",
		text: {
			noUserFound: "❌ لم يتم العثور على أي مستخدم مطابق للاسم بالكلمة المفتاحية: \"%1\" في بيانات البوت",
			userFound: "🔎 تم العثور على %1 مستخدم مطابق للاسم بالكلمة المفتاحية \"%2\" في بيانات البوت:\n%3",
			uidRequired: "معرف المستخدم المراد حظره لا يمكن أن يكون فارغاً، يرجى إدخال المعرف (uid) أو الإشارة أو الرد على رسالة المستخدم بالشكل: user ban <uid> <السبب>",
			reasonRequired: "سبب حظر المستخدم لا يمكن أن يكون فارغاً، يرجى إدخال السبب بالشكل: user ban <uid> <السبب>",
			userHasBanned: "المستخدم ذو المعرف [%1 | %2] محظور مسبقاً:\n» السبب: %3\n» التاريخ: %4",
			userBanned: "تم حظر المستخدم ذو المعرف [%1 | %2]:\n» السبب: %3\n» التاريخ: %4",
			uidRequiredUnban: "معرف المستخدم (uid) المراد إلغاء حظره لا يمكن أن يكون فارغاً",
			userNotBanned: "المستخدم ذو المعرف [%1 | %2] ليس محظوراً",
			userUnbanned: "تم إلغاء حظر المستخدم ذو المعرف [%1 | %2]"
		}
	},
	videofb: {
		description: "تنزيل فيديو / قصة (Story) من فيسبوك (عام)",
		guide: "   {pn} <رابط الفيديو/القصة>: تحميل الفيديو من فيسبوك",
		text: {
			missingUrl: "يرجى إدخال رابط فيديو أو قصة فيسبوك (العامة) التي تريد تنزيلها",
			error: "حدث خطأ أثناء تنزيل الفيديو",
			downloading: "جاري تنزيل الفيديو من أجلك",
			tooLarge: "عذراً، لا يمكننا تنزيل الفيديو من أجلك لأن حجمه أكبر من 83 ميجابايت"
		}
	},
	warn: {
		description: "تحذير عضو في المجموعة، وإذا تلقى 3 تحذيرات، سيتم حظره تلقائياً",
		guide: "   {pn} @tag <السبب>: تحذير عضو\n   {pn} list: عرض قائمة الأعضاء المحذيرين\n   {pn} listban: عرض قائمة الأعضاء المحظورين\n   {pn} info [@tag | <uid> | فارغ]: عرض معلومات تحذير العضو المشار إليه أو المعرف أو نفسك\n   {pn} unban <uid>: إلغاء حظر عضو بواسطة المعرف\n   {pn} unwarn <uid> [<رقم التحذير> | فارغ]: إزالة تحذير عن عضو بواسطة المعرف ورقم التحذير\n   {pn} warn reset: إعادة تعيين جميع بيانات التحذيرات\n⚠️ يجب عليك تعيين البوت كمسؤول (مشرف) لكي يتمكن من طرد الأعضاء المحظورين تلقائياً",
		text: {
			list: "قائمة الأعضاء الذين تم تحذيرهم:\n%1\n\nلعرض تفاصيل التحذيرات، استخدم الأمر \"%2warn info [@tag | <uid> | فارغ]\": لعرض معلومات تحذير الشخص المشار إليه أو المعرف أو نفسك",
			listBan: "قائمة الأعضاء الذين تم تحذيرهم 3 مرات وتم حظرم من مجموعة الدردشة:\n%1",
			listEmpty: "لا يوجد أي أعضاء تم تحذيرهم في مجموعتك",
			listBanEmpty: "لا يوجد أي أعضاء محظورين من المجموعة",
			invalidUid: "يرجى إدخال معرف (uid) صالح للشخص الذي تريد عرض معلوماته",
			noData: "لا توجد بيانات",
			noPermission: "❌ مشرفو المجموعة فقط هم من يمكنهم إلغاء حظر الأعضاء المحظورين من المجموعة",
			invalidUid2: "⚠️ يرجى إدخال معرف (uid) صالح للشخص الذي تريد إلغاء حظره",
			notBanned: "⚠️ المستخدم ذو المعرف %1 ليس محظوراً من مجموعتك",
			unbanSuccess: "✅ تم بنجاح إلغاء حظر العضو [%1 | %2]، يمكن لهذا الشخص الآن الانضمام إلى مجموعة الدردشة الخاصة بك",
			noPermission2: "❌ مشرفو المجموعة فقط هم من يمكنهم إزالة التحذيرات عن الأعضاء في المجموعة",
			invalidUid3: "⚠️ يرجى إدخال معرف (uid) أو الإشارة إلى الشخص الذي تريد إزالة التحذير عنه",
			noData2: "⚠️ المستخدم ذو المعرف %1 ليس لديه أي بيانات تحذير",
			notEnoughWarn: "❌ المستخدم %1 لديه %2 تحذيرات فقط",
			unwarnSuccess: "✅ تم بنجاح إزالة التحذير رقم %1 للعضو [%2 | %3]",
			noPermission3: "❌ مشرفو المجموعة فقط هم من يمكنهم إعادة تعيين بيانات التحذيرات",
			resetWarnSuccess: "✅ تم بنجاح إعادة تعيين بيانات التحذيرات",
			noPermission4: "❌ مشرفو المجموعة فقط هم من يمكنهم تحذير الأعضاء في المجموعة",
			invalidUid4: "⚠️ يجب عليك الإشارة أو الرد على رسالة الشخص الذي تريد تحذيره",
			warnSuccess: "⚠️ تم تحذير العضو للمرة %1 | السبب: %2\n- المعرف (Uid): %3\n- السبب: %4\n- التاريخ والوقت: %5\nلقد تلقى هذا العضو 3 تحذيرات وتم حظره من المجموعة، لإلغاء الحظر استخدم الأمر \"%6warn unban <uid>\" (حيث uid هو معرف الشخص المراد إلغاء حظره)",
			noPermission5: "⚠️ يحتاج البوت إلى صلاحيات المشرف لطرد الأعضاء المحظورين",
			warnSuccess2: "⚠️ تم تحذير العضو للمرة %1 | السبب: %2\n- المعرف (Uid): %3\n- السبب: %4\n- التاريخ والوقت: %5\nإذا قام هذا الشخص بالمخالفة %6 مرات أخرى، فسوف يتم طرده من المجموعة",
			hasBanned: "⚠️ الأعضاء التالي ذكرهم تلقوا 3 تحذيرات مسبقاً وتم حظرهم من المجموعة:\n%1",
			failedKick: "⚠️ حدث خطأ أثناء محاولة طرد الأعضاء التاليين:\n%1"
		}
	},
	weather: {
		description: "عرض حالة الطقس الحالية وتوقعات الأيام الـ 5 القادمة",
		guide: "{pn} <المنطقة / المدنية>",
		text: {
			syntaxError: "يرجى إدخال اسم المنطقة أو المدنية",
			notFound: "لم يتم العثور على الموقع: %1",
			error: "حدث خطأ ما: %1",
			today: "طقس اليوم:\n%1\n🌡 درجة الحرارة الصغرى - الكبرى %2°C - %3°C\n🌡 الشعور بالحرارة %4°C - %5°C\n🌅 شروق الشمس %6\n🌄 غروب الشمس %7\n🌃 شروق القمر %8\n🏙️ غروب القمر %9\n🌞 النهار: %10\n🌙 الليل: %11"
		}
	},
	ytb: {
		description: "تنزيل فيديو، ملف صوتي، أو عرض معلومات فيديو من يوتيوب (YouTube)",
		guide: "   {pn} [video|-v] [<اسم الفيديو>|<رابط الفيديو>]: لتنزيل فيديو من يوتيوب.\n   {pn} [audio|-a] [<اسم الفيديو>|<رابط الفيديو>]: لتنزيل الصوت من يوتيوب\n   {pn} [info|-i] [<اسم الفيديو>|<رابط الفيديو>]: لعرض معلومات فيديو من يوتيوب\n   مثال:\n    {pn} -v Fallen Kingdom\n    {pn} -a Fallen Kingdom\n    {pn} -i Fallen Kingdom",
		text: {
			error: "حدث خطأ ما: %1",
			noResult: "لا توجد نتائج بحث مطابقة للكلمة المفتاحية %1",
			choose: "%1الرد على الرسالة بالرقم للاختيار أو أي محتوى للإلغاء",
			downloading: "جاري تنزيل الفيديو %1",
			noVideo: "عذراً، لم يتم العثور على فيديو بحجم أقل من 83 ميجابايت",
			downloadingAudio: "جاري تنزيل الملف الصوتي %1",
			noAudio: "عذراً، لم يتم العثور على ملف صوتي بحجم أقل من 26 ميجابايت",
			info: "💠 العنوان: %1\n🏪 القناة: %2\n👨‍👩‍👧‍👦 المشتركون: %3\n⏱ مدة الفيديو: %4\n👀 المشاهدات: %5\n👍 الإعجابات: %6\n🆙 تاريخ الرفع: %7\n🔠 المعرف: %8\n🔗 الرابط: %9",
			listChapter: "\n📖 قائمة الفصول: %1\n"
		}
	}
};
